---
kind: property
id: P:Autodesk.Revit.DB.Visual.Concrete.ConcreteSealant
source: html/f7632748-9f37-e8b4-e804-7bac155482e4.htm
---
# Autodesk.Revit.DB.Visual.Concrete.ConcreteSealant Property

The property labeled "Sealant" from the "Concrete" schema.

## Syntax (C#)
```csharp
public static string ConcreteSealant { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteSealantType".